Documents/А_ПереносДвиженийИзКазны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_ПереносДвиженийИзКазны</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.А_ДвиженияДенегИзКазны</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтрокиДвижений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаДвижения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчетКасса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>А_ОрганизацияБухгалтерия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКазна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельностиКазна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументДвиженияКазны</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.А_ПриходДенегОтФинАгента</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.А_ПереносДвиженийИзКазны</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UIDРегистратораКазны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстДокументаКазны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/А_ДвиженияДенегИзКазны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>А_ДвиженияДенегИзКазны</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>UIDРегистратораКазны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстДокументаКазны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>А_ОрганизацияБухгалтерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКазна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельностиКазна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументДвиженияКазны</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.А_ПриходДенегОтФинАгента</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.А_ПереносДвиженийИзКазны</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СоответствияОбъектовИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СоответствияОбъектовИнформационныхБаз</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УникальныйИдентификаторИсточникаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбъектВыгруженПоСсылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторИсточника</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваУЭквайера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваУПодотчетногоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Депозиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеДокументы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Кассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Кассы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВКассовойКниге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПлатежиБезУказанияЗаявок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИнкассации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКассаОбособленногоПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбособленныеПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоОбособленномуПодразделению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ОрганизацияБухгалтерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ПодразделениеКазна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиПлатежейПриПеремещенииДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолучательПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/А_ПереносДвиженийИзКазны/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = А_Привилегированный.А_ПолучитьОрганизациюУпр();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Месяц) Тогда
		Месяц = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// === Захист від дублікатів: один документ на (Организация, Месяц) ===
	// Без цієї перевірки повторне проведення/створення документа за вже занесений місяць
	// дає подвоєння рухів у регістрі А_ДвиженияДенегИзКазны і відповідно — подвоєння Каси у звіті PnL.
	НачМесяца = НачалоМесяца(Месяц);
	КонМесяца = КонецМесяца(Месяц);

	ЗапросДубль = Новый Запрос;
	ЗапросДубль.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Док.Ссылка КАК Ссылка,
	|	Док.Номер  КАК Номер,
	|	Док.Дата   КАК Дата,
	|	Док.Месяц  КАК Месяц
	|ИЗ Документ.А_ПереносДвиженийИзКазны КАК Док
	|ГДЕ
	|	Док.Ссылка <> &ТекущийДок
	|	И НЕ Док.ПометкаУдаления
	|	И Док.Проведен
	|	И Док.Организация = &Организация
	|	И Док.Месяц МЕЖДУ &НачМесяца И &КонМесяца";
	ЗапросДубль.УстановитьПараметр("ТекущийДок",  Ссылка);
	ЗапросДубль.УстановитьПараметр("Организация", Организация);
	ЗапросДубль.УстановитьПараметр("НачМесяца",   НачМесяца);
	ЗапросДубль.УстановитьПараметр("КонМесяца",   КонМесяца);
	РезДубль = ЗапросДубль.Выполнить();
	Если НЕ РезДубль.Пустой() Тогда
		ВыбДубль = РезДубль.Выбрать();
		ВыбДубль.Следующий();
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон("Не можна провести: за %1 (Організація %2) вже проведено документ %3 (від %4). Перепроведіть існуючий або помітьте його на видалення.",
				Формат(НачМесяца, "ДФ='ММММ yyyy'"),
				Организация,
				ВыбДубль.Номер,
				Формат(ВыбДубль.Дата, "ДФ='dd.MM.yyyy'")));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// Пакетне формування рухів через Загрузить(ТЗ) — одна операція замість тисяч .Добавить().
	// Запит формує готовий набір записів, ВЫГРУЗИТЬ() віддає ТаблицюЗначень із колонками,
	// що відповідають вимірюванням/ресурсам/реквізитам регістра.

	Движения.А_ДвиженияДенегИзКазны.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Т.ДатаДвижения = ДАТАВРЕМЯ(1, 1, 1) ТОГДА &Дата
	|		ИНАЧЕ Т.ДатаДвижения
	|	КОНЕЦ                                                            КАК Период,
	|	ИСТИНА                                                           КАК Активность,
	|	Т.БанковскийСчетКасса                                            КАК БанковскийСчетКасса,
	|	&Организация                                                     КАК Организация,
	|	Т.А_ОрганизацияБухгалтерия                                       КАК А_ОрганизацияБухгалтерия,
	|	Т.ТипДенежныхСредств                                             КАК ТипДенежныхСредств,
	|	Т.СтатьяДвиженияДенежныхСредств                                  КАК СтатьяДвиженияДенежныхСредств,
	|	Т.ПодразделениеКазна                                             КАК ПодразделениеКазна,
	|	Т.НаправлениеДеятельностиКазна                                   КАК НаправлениеДеятельностиКазна,
	|	Т.Подразделение                                                  КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Т.ДокументДвиженияКазны ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ИЛИ Т.ДокументДвиженияКазны ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ИЛИ Т.ДокументДвиженияКазны ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ИЛИ Т.ДокументДвиженияКазны ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|			ИЛИ Т.ДокументДвиженияКазны ССЫЛКА Документ.А_ПриходДенегОтФинАгента
	|			ТОГДА Т.ДокументДвиженияКазны
	|		ИНАЧЕ &Ссылка
	|	КОНЕЦ                                                            КАК ДокументДвиженияКазны,
	|	Т.UIDРегистратораКазны                                           КАК UIDРегистратораКазны,
	|	Т.ТекстДокументаКазны                                            КАК ТекстДокументаКазны,
	|	Т.Сумма                                                          КАК Сумма
	|ИЗ
	|	Документ.А_ПереносДвиженийИзКазны.СтрокиДвижений КАК Т
	|ГДЕ
	|	Т.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	Т.НомерСтроки";

	Запрос.УстановитьПараметр("Ссылка",      Ссылка);
	Запрос.УстановитьПараметр("Дата",        Дата);
	Запрос.УстановитьПараметр("Организация", Организация);

	Движения.А_ДвиженияДенегИзКазны.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Заповнює ТЧ Движения з регістра БДДС бази BuhKazn (COM).
//
Процедура ЗаполнитьИзКазны() Экспорт

	Если НЕ ЗначениеЗаполнено(Месяц) Тогда
		ВызватьИсключение "Не вказаний реквізит ""Місяць""!";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = А_Привилегированный.А_ПолучитьОрганизациюУпр();
	КонецЕсли;

	НачалоПериода = НачалоМесяца(Месяц);
	КонецПериода  = КонецМесяца(Месяц);

	Попытка
		V83 = А_ПодключенияБазСервер.УстановитьСоединение("BuhKazn");
	Исключение
		ВызватьИсключение "Помилка підключення до BuhKazn: " + ОписаниеОшибки();
	КонецПопытки;

	Запрос = V83.NewObject("Запрос");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БДДС.Период КАК Период,
	|	БДДС.Регистратор КАК Регистратор,
	|	БДДС.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
	|	БДДС.Подразделение КАК Подразделение,
	|	БДДС.Направление КАК Направление,
	|	БДДС.ВидОплаты КАК ВидОплаты,
	|	СУММА(БДДС.СуммаПриход) КАК СуммаПриход,
	|	СУММА(БДДС.СуммаРасход) КАК СуммаРасход
	|ИЗ
	|	РегистрНакопления.БДДС КАК БДДС
	|ГДЕ
	|	БДДС.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ БДДС.ПланФакт
	|	И БДДС.Активность
	|СГРУППИРОВАТЬ ПО
	|	БДДС.Период,
	|	БДДС.Регистратор,
	|	БДДС.СтатьяДвиженияДенежныхСредств,
	|	БДДС.Подразделение,
	|	БДДС.Направление,
	|	БДДС.ВидОплаты
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);

	Попытка
		ТЗ = Запрос.Выполнить().Выгрузить();
	Исключение
		V83 = Неопределено;
		V8  = Неопределено;
		ВызватьИсключение "Помилка запиту до БДДС: " + ОписаниеОшибки();
	КонецПопытки;

	СтрокиДвижений.Очистить();
	СчетчикДодано = 0;

	Для Каждого СтрокаТЗ Из ТЗ Цикл

		Сумма = ?(СтрокаТЗ.СуммаПриход <> 0, СтрокаТЗ.СуммаПриход, -СтрокаТЗ.СуммаРасход);
		Если Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = СтрокиДвижений.Добавить();
		НоваяСтрока.ДатаДвижения = СтрокаТЗ.Период;
		НоваяСтрока.Сумма        = Сумма;

		// === ВидОплаты -> ТипДенежныхСредств ===
		ЭтоБезналичные = Ложь;
		Если СтрокаТЗ.ВидОплаты <> Неопределено Тогда
			ВидОплатыСтрока = V83.String(СтрокаТЗ.ВидОплаты);
			Если Найти(ВидОплатыСтрока, "Безналичные") > 0 Тогда
				НоваяСтрока.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;
				ЭтоБезналичные = Истина;
			ИначеЕсли Найти(ВидОплатыСтрока, "Наличные") > 0 Тогда
				НоваяСтрока.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные;
			КонецЕсли;
		КонецЕсли;

		// === Стаття ДДС: по Коду -> Найменуванню ===
		Попытка
			Если СтрокаТЗ.СтатьяДДС <> Неопределено Тогда
				КодСтатьи = СокрЛП(V83.String(СтрокаТЗ.СтатьяДДС.Код));
				Найден = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду(КодСтатьи);
				Если НЕ ЗначениеЗаполнено(Найден) Тогда
					НаимСтатьи = СокрЛП(V83.String(СтрокаТЗ.СтатьяДДС.Наименование));
					Если ЗначениеЗаполнено(НаимСтатьи) Тогда
						Найден = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию(НаимСтатьи);
					КонецЕсли;
				КонецЕсли;
				НоваяСтрока.СтатьяДвиженияДенежныхСредств = Найден;
			КонецЕсли;
		Исключение
		КонецПопытки;

		// === ПодразделениеКазна (Казна.Подразделения -> ERP.СтруктураПредприятия) ===
		ПодрКазна = Справочники.СтруктураПредприятия.ПустаяСсылка();
		Попытка
			Если СтрокаТЗ.Подразделение <> Неопределено Тогда
				КодПодр = СокрЛП(V83.String(СтрокаТЗ.Подразделение.Код));
				Если ЗначениеЗаполнено(КодПодр) Тогда
					ПодрКазна = Справочники.СтруктураПредприятия.НайтиПоКоду(КодПодр);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ПодрКазна) Тогда
					НаимПодр = СокрЛП(V83.String(СтрокаТЗ.Подразделение.Наименование));
					Если ЗначениеЗаполнено(НаимПодр) Тогда
						ПодрКазна = Справочники.СтруктураПредприятия.НайтиПоНаименованию(НаимПодр);
					КонецЕсли;
				КонецЕсли;
				НоваяСтрока.ПодразделениеКазна = ПодрКазна;
			КонецЕсли;
		Исключение
		КонецПопытки;

		// === НаправлениеДеятельностиКазна ===
		НапрКазна = Справочники.НаправленияДеятельности.ПустаяСсылка();
		Попытка
			Если СтрокаТЗ.Направление <> Неопределено Тогда
				КодНапр = СокрЛП(V83.String(СтрокаТЗ.Направление.Код));
				Если ЗначениеЗаполнено(КодНапр) Тогда
					НапрКазна = Справочники.НаправленияДеятельности.НайтиПоКоду(КодНапр);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(НапрКазна) Тогда
					НаимНапр = СокрЛП(V83.String(СтрокаТЗ.Направление.Наименование));
					Если ЗначениеЗаполнено(НаимНапр) Тогда
						НапрКазна = Справочники.НаправленияДеятельности.НайтиПоНаименованию(НаимНапр);
					КонецЕсли;
				КонецЕсли;
				НоваяСтрока.НаправлениеДеятельностиКазна = НапрКазна;
			КонецЕсли;
		Исключение
		КонецПопытки;

		// === Підрозділ ERP (вирахуваний) ===
		Если ЗначениеЗаполнено(ПодрКазна) И ЗначениеЗаполнено(НапрКазна) Тогда
			НоваяСтрока.Подразделение = А_Привилегированный.А_ПолучитьПодразделениеПоНаправлениюИПодразделениюКазны(
				НапрКазна, ПодрКазна);
		ИначеЕсли ЗначениеЗаполнено(ПодрКазна) Тогда
			НоваяСтрока.Подразделение = ПодрКазна;
		КонецЕсли;

		// === А_ОрганизацияБухгалтерия (по КодПоЕДРПОУ із Регістратора) ===
		Попытка
			Если СтрокаТЗ.Регистратор <> Неопределено Тогда
				ОргКазна = СтрокаТЗ.Регистратор.Организация;
				Если ОргКазна <> Неопределено Тогда
					КодЕДРПОУ = СокрЛП(V83.String(ОргКазна.КодПоЕДРПОУ));
					Если ЗначениеЗаполнено(КодЕДРПОУ) Тогда
						НоваяСтрока.А_ОрганизацияБухгалтерия =
							Справочники.Организации.НайтиПоРеквизиту("КодПоЕДРПОУ", КодЕДРПОУ);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;

		// === БанковскийСчетКасса і парний ERP-документ ===
		Если СтрокаТЗ.Регистратор <> Неопределено Тогда

			// Текст для розшифровки
			Попытка
				ТипДок  = V83.String(СтрокаТЗ.Регистратор.Метаданные().Имя);
				НомерДок = СокрЛП(V83.String(СтрокаТЗ.Регистратор.Номер));
				ДатаДок  = СтрокаТЗ.Регистратор.Дата;
				НоваяСтрока.ТекстДокументаКазны = СтрШаблон("%1 %2 від %3",
					ТипДок, НомерДок, Формат(ДатаДок, "ДФ=dd.MM.yyyy"));
			Исключение
			КонецПопытки;

			// UID
			УИДКазна = "";
			Попытка
				УИДКазна = V83.String(СтрокаТЗ.Регистратор.УникальныйИдентификатор());
				НоваяСтрока.UIDРегистратораКазны = УИДКазна;
			Исключение
			КонецПопытки;

			// БанковскийСчетКасса з реквізитів документа Казни
			Попытка
				Если ЭтоБезналичные Тогда
					СчетКазна = СтрокаТЗ.Регистратор.БанковскийСчет;
					Если СчетКазна <> Неопределено Тогда
						БСч = НайтиБанковскийСчетПоКазне(V83, СчетКазна);
						НоваяСтрока.БанковскийСчетКасса = БСч;
					КонецЕсли;
				Иначе
					КассаКазна = СтрокаТЗ.Регистратор.Касса;
					Если КассаКазна <> Неопределено Тогда
						КассаERP = НайтиКассуПоКазне(V83, КассаКазна);
						НоваяСтрока.БанковскийСчетКасса = КассаERP;
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;

			// Парний ERP-документ через СоответствияОбъектовИнформационныхБаз
			Попытка
				Если ЗначениеЗаполнено(УИДКазна) Тогда
					ЗапросСоотв = Новый Запрос;
					ЗапросСоотв.Текст =
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	Соотв.УникальныйИдентификаторИсточника КАК ДокументERP
					|ИЗ
					|	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК Соотв
					|ГДЕ
					|	Соотв.УникальныйИдентификаторПриемника = &УИД";
					ЗапросСоотв.УстановитьПараметр("УИД", УИДКазна);
					Рез = ЗапросСоотв.Выполнить();
					Если НЕ Рез.Пустой() Тогда
						Выб = Рез.Выбрать();
						Выб.Следующий();
						Если ЗначениеЗаполнено(Выб.ДокументERP) Тогда
							НоваяСтрока.ДокументДвиженияКазны = Выб.ДокументERP;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;

		СчетчикДодано = СчетчикДодано + 1;
	КонецЦикла;

	V83 = Неопределено;
	V8  = Неопределено;

	Сообщить("Завантажено рядків: " + СчетчикДодано);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Маппінг банківського рахунку Казна -> ERP
Функция НайтиБанковскийСчетПоКазне(V83, СчетКазна)

	НайденнаяСсылка = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();

	// Спроба 1: по Коду через А_Код1С
	Попытка
		КодКазны = СокрЛП(V83.String(СчетКазна.Код));
		Если ЗначениеЗаполнено(КодКазны) Тогда
			НайденнаяСсылка = Справочники.БанковскиеСчетаОрганизаций.НайтиПоРеквизиту("А_Код1С", КодКазны);
		КонецЕсли;
	Исключение
	КонецПопытки;

	// Спроба 2: по НомерСчета
	Если НЕ ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Попытка
			НомерСчета = СокрЛП(V83.String(СчетКазна.НомерСчета));
			Если ЗначениеЗаполнено(НомерСчета) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	БС.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.БанковскиеСчетаОрганизаций КАК БС
				|ГДЕ
				|	БС.НомерСчета = &Н
				|	И НЕ БС.А_НеИспользовать
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ ПЕРВЫЕ 1
				|	БС.Ссылка
				|ИЗ
				|	Справочник.БанковскиеСчетаОрганизаций КАК БС
				|ГДЕ
				|	БС.А_НомерСчетаКазна = &Н
				|	И НЕ БС.А_НеИспользовать";
				Запрос.УстановитьПараметр("Н", НомерСчета);
				Рез = Запрос.Выполнить();
				Если НЕ Рез.Пустой() Тогда
					Выб = Рез.Выбрать();
					Выб.Следующий();
					НайденнаяСсылка = Выб.Ссылка;
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;

	// Спроба 3: А_СчетДляСверкиПоКазне
	Если ЗначениеЗаполнено(НайденнаяСсылка)
	   И ЗначениеЗаполнено(НайденнаяСсылка.А_СчетДляСверкиПоКазне) Тогда
		НайденнаяСсылка = НайденнаяСсылка.А_СчетДляСверкиПоКазне;
	КонецЕсли;

	Возврат НайденнаяСсылка;

КонецФункции

// Маппінг каси Казна -> ERP (по UUID, потім по коду/найменуванню)
Функция НайтиКассуПоКазне(V83, КассаКазна)

	КассаERP = Справочники.Кассы.ПустаяСсылка();

	Попытка
		УИД = V83.String(КассаКазна.УникальныйИдентификатор());
		КассаERP = А_Привилегированный.ПолучитьСправочникUID("Кассы", УИД);
	Исключение
	КонецПопытки;

	Если НЕ ЗначениеЗаполнено(КассаERP) Тогда
		Попытка
			Код = СокрЛП(V83.String(КассаКазна.Код));
			Если ЗначениеЗаполнено(Код) Тогда
				КассаERP = Справочники.Кассы.НайтиПоКоду(Код);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(КассаERP) Тогда
		Попытка
			Наим = СокрЛП(V83.String(КассаКазна.Наименование));
			Если ЗначениеЗаполнено(Наим) Тогда
				КассаERP = Справочники.Кассы.НайтиПоНаименованию(Наим, Истина);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;

	Возврат КассаERP;

КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
Месяц = НачалоМесяца(Дата);	  
 //ЗаполнитьИзКазны();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
